from game_manager import play_logic, validation
import random


def run_game():
    print('\n--- ПРАВИЛА ИГРЫ ---')
    print('Цель: угадать загаданное из 5 букв слово за 6 попыток.')
    print('Вводите слово из 5 букв и получайте цветные подсказки:')
    print('🟩 Зеленый - буква на правильном месте')
    print('🟨 Желтый - буква есть в слове, но на другом месте')
    print('⬜ Серый - буквы нет в слове')

    print('\n--- ВЫБОР РЕЖИМА ИГРЫ ---')
    print('1 - Играть с компьютером')
    print('2 - Играть с другом')

    while True:
        try:
            game_mode_choice = int(input('\nВаш выбор (введите число): ').strip())

            if game_mode_choice == 1 or game_mode_choice == 2:
                break
            else:
                print('Ошибка: вы ввели некорректное значение! Попробуйте ещё раз.')

        except ValueError:
            print('Ошибка: введите число 1 или 2!')

    if game_mode_choice == 1:
        print('\n' * 40)
        print('Компьютер загадал слово. Введите русское слово из 5 букв, чтобы угадать. У вас 6 попыток. Удачи!')

        words = ['ангар', 'касса', 'стиль', 'принт']
        target_word = random.choice(words)
        play_logic(target_word)

    elif game_mode_choice == 2:
        print('\n' * 40)
        print('Отвернитесь, пока ваш друг загадывает слово')
        print('Введите слово, которое вы загадали: ')
        friend_word = validation()

        print('\n' * 40)
        print('Теперь угадывайте слово!')
        play_logic(friend_word.lower())


print('\n' * 10)
print('╔══════════════════════════════════════╗')
print('║      ДОБРО ПОЖАЛОВАТЬ В WORDLE!      ║')
print('╚══════════════════════════════════════╝\n')

run_game()

while True:
    a = input('\n\nСыграть еще раз? Да/нет: ').strip().upper()

    if a == 'ДА':
        print('\n' * 10)
        run_game()
    elif a == 'НЕТ':
        print('👋 Очень жаль. До свидания!')
        break
    else:
        print('Ошибка: некорректное значение. Попробуйте еще раз.')


