from game_manager import run_game


print('\n' * 10)
print('╔══════════════════════════════════════╗')
print('║      ДОБРО ПОЖАЛОВАТЬ В WORDLE!      ║')
print('╚══════════════════════════════════════╝\n')

run_game()

while True:
    a = input('\n\nСыграть еще раз? Да/нет: ').strip().upper()

    if a == 'ДА':
        print('\n' * 10)
        run_game()
    elif a == 'НЕТ':
        print('👋 Очень жаль. До свидания!')
        break
    else:
        print('Ошибка: некорректное значение. Попробуйте еще раз.')
